# Задание - 1
# Вам даны 2 списка одинаковой длины, в первом списке имена людей, во втором зарплаты,
# вам необходимо получить на выходе словарь, где ключ - имя, значение - зарплата.
# Запишите результаты в файл salary.txt так, чтобы на каждой строке было 2 столбца,
# столбцы разделяются пробелом, тире, пробелом. в первом имя, во втором зарплата, например: Vasya - 5000

# После чего прочитайте файл, выведите построчно имя и зарплату минус 13% (налоги ведь),
# Есть условие, не отображать людей получающих более зарплату 500000, как именно
#  выполнить условие решать вам, можете не писать в файл
# можете не выводить, подумайте какой способ будет наиболее правильным и оптимальным,
#  если скажем эти файлы потом придется передавать.
# Так же при выводе имя должно быть полностью в верхнем регистре!
# Подумайте вспоминая урок, как это можно сделать максимально кратко,
# используя возможности языка Python.


people = ['андрей', 'саня', 'вася', 'чувак', 'чувиха', 'duuuude']
money = [1000000, 45000, 35000, 75000, 600000, 13400]
tax = 0.13


def salary(people, money):
    '''Начисление зарплаты работникам без учёта вычета налогов'''
    salary_dict = dict(zip(people, money))              # создаем из 2х списков словарь вида {работник: зарплата}
    return salary_dict


def data_write(file, **salary):
    '''Записывает данные о работниках и их зарплате в файл'''
    with open(file, 'w') as file:
        for human, money in salary.items():
            file.write('{} - {}\n'.format(human.title(), str(money)))


def clear_cash(file, tax):
    '''Вычитает налог с зарплаты каждого работника'''
    cash_dict = {}
    with open(file) as file:
        for line in file:
            divide = line.strip().split(' - ')          # создаем списки работников и их з/п в виде [worker, raw_money]
            worker, raw_money = divide[0], float(divide[1])
            get_money = raw_money - raw_money * tax     # вычитаем налог
            cash_dict[worker] = get_money               # записываем конечные данные во временный словарь
    return cash_dict


def printing_worker_info_filtered(cut=500000, **kwargs):
    '''Выводим построчно зарплату работников, если она меньше значения cut'''
    for key, value in kwargs.items():
        if float(value) < cut:
            print('{} получает зарплату в размере {}'.format(key, value))


# начисляем зарплаты работникам
salaries = salary(people, money)

# записываем данные о зарплатах и работниках в файл salary2.txt
data_write('salary2.txt', **salaries)

# вычитаем 13% налог из зарплат работников
cash_money = clear_cash('salary2.txt', tax)

# Выводим информацию о зарплатах работников "на руки"
printing_worker_info_filtered(**cash_money)