
# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

from math import sqrt

nums = [-5, 47, 9, 24, 36, -18, 16]
sr_nums = []
for num in nums:
    if num>=0 and sqrt(num).is_integer():
        sr_nums.append(int(sqrt(num)))
print(sr_nums)

# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

days = {
    '01':'первое','02':'второе','03':'третье','04':'четвертое','05':'пятое','06':'шестое',
    '07':'седьмое','08':'восьмое','09':'девятое','10':'десятое','11':'одиннадцатое',
    '12':'двенадцатое','13':'тринадцатое','14':'четырнадцатое','15':'пятнадцатое',
    '16':'шестнадцатое','17':'семнадцатое','18':'восемнадцатое','19':'девятнадцатое',
    '20':'двадцатое','21':'двадцать первое','22':'двадцать второе','23':'двадцать третье',
    '24':'двадцать четвертое','25':'двадцать пятое','26':'двадцать шестое','27':'двадцать седьмое',
    '28':'двадцать восьмое','29':'двадцать девятое','30':'тридцатое','31':'тридцать первое'
    }
months = {
    '01':'января','02':'февраля','03':'марта','04':'апреля','05':'мая','06':'июня','07':'июля',
    '08':'августа','09':'сентября','10':'октября','11':'ноября','12':'декабря'
    }
data=str(input('Введите дату в формате dd.mm.yyyy\n')).split('.')
txt_data=[]
for i in data:
    if data[0]:
        txt_data.append(days[data[0]])
    elif data[1]:
        txt_data.append(days[data[1]])
print(txt_data)
