
# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

from math import sqrt

nums = [-5, 47, 9, 24, 36, -18, 16]
sr_nums = []
for num in nums:
    if num>=0 and sqrt(num).is_integer():
        sr_nums.append(int(sqrt(num)))
print(sr_nums)
