# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

#fruits = ['apple', 'banana', 'kiwi', 'watermelon']
#i=0
#for fruit in fruits:
#    i+=1
#    print('{}. {}'.format(i,fruit.rjust(10,' ')))

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

spisok1=['a','g', 45, 'word','z']
spisok2=['word','b', 45, 'a', 'cd']
spisok1= set(spisok1)-set(spisok2)
print('spisok1=',list(spisok1))
