
# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

# from math import sqrt
#
# nums = [-5, 47, 9, 24, 36, -18, 16]
# sr_nums = []
# for num in nums:
#     if num>=0 and sqrt(num).is_integer():
#         sr_nums.append(int(sqrt(num)))
# print(sr_nums)

# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

days = {
    '01':'первое','02':'второе','03':'третье','04':'четвертое','05':'пятое','06':'шестое',
    '07':'седьмое','08':'восьмое','09':'девятое','10':'десятое','11':'одиннадцатое',
    '12':'двенадцатое','13':'тринадцатое','14':'четырнадцатое','15':'пятнадцатое',
    '16':'шестнадцатое','17':'семнадцатое','18':'восемнадцатое','19':'девятнадцатое',
    '20':'двадцатое','21':'двадцать первое','22':'двадцать второе','23':'двадцать третье',
    '24':'двадцать четвертое','25':'двадцать пятое','26':'двадцать шестое','27':'двадцать седьмое',
    '28':'двадцать восьмое','29':'двадцать девятое','30':'тридцатое','31':'тридцать первое'
    }
months = {
    '01':'января','02':'февраля','03':'марта','04':'апреля','05':'мая','06':'июня','07':'июля',
    '08':'августа','09':'сентября','10':'октября','11':'ноября','12':'декабря'
    }
output=[]
tmp_data=str(input('Введите дату в формате dd.mm.yyyy\n'))
data = tmp_data.split('.')
#print(tmp_data[2:6:3]) - тест программы на наличие разделительных точек в строке даты
if len(tmp_data)!= 10 or tmp_data[2:6:3]!='..' or (data[0].isdigit()==False or data[1].isdigit()==False or data[2].isdigit()==False):
    print('Вы ввели дату в неправильном формате.')
else:
    if data[0] not in days:
        print('Вы ввели неправильный день. Вводите от 01 до 31.')
    elif data[1] not in months:
        print('Вы ввели неправильный месяц. Вводите от 01 до 12.')
    else:
        years=int(data[2])
    #print(data) - проверка работы метода split в программе
        if data[1]=='02' and data[0]=='29' and years%4!=0:
            print('Этот год не високосный, в феврале 28 дней')
        elif data[1]=='02' and (data[0]=='30'or data[0]=='31'):
            print('В феврале не может быть столько дней. Вы ввели некорректные данные.')
        elif data[0]=='31' and (data[1]=='04'or data[1]=='06'or data[1]=='09'or data[1]=='11'):
            print('В этом месяце 30 дней, вы неправильно ввели день')
        else:
            print('{} {} {} года'.format(days[data[0]], months[data[1]], years))

# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random

from random import randint
nums = []
n = 0
while n != 10:
    nums.append(randint(-100, 100))
    n += 1
print(nums)

# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут:
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

print('Задача 4, часть 1')
lst = [1, 2, 4, 5, 6, 2, 5, 2]
lst2 = list(set(lst))
print(lst2)

print("Задача 4, часть 2")
lst = [1, 2, 4, 5, 6, 2, 5, 2]
lst2=[]
for num in lst:
    if lst.count(num)==1:
        lst2.append(num)
print(lst2)